app/views/individuals/index.html.erb

SELECT "titles".* FROM "titles" WHERE "titles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <td>
                  <%= link_to (individual.title.name + " " + individual.first + " " + individual.last), individual %>