app/views/villages/show.html.erb

          <tbody>
          <% @village.contacts.each do |contact| %>
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."village_id" = ?  [["village_id", 3]]

          <tbody>
          <% @village.vreceipts.order(rdate: :desc).each do |rec| %>
---
SELECT "vreceipts".* FROM "vreceipts" WHERE "vreceipts"."village_id" = ? ORDER BY "vreceipts"."rdate" DESC  [["village_id", 3]]