app/views/residents/_form.html.erb

SELECT "villages".* FROM "villages" ORDER BY "villages"."name" ASC
---
    <div class="form-inputs col-xs-8">
      <%= f.association :village, collection: Village.order(:name) %>