app/controllers/associates_controller.rb

  def index
    # @associates = Associate.all.order("surname ASC")
    @associates = Associate.financial.order("surname ASC")
---
SELECT "associates".* FROM "associates" ORDER BY surname ASC

  def notfinancial
    @associates = Associate.notfinancial.order("surname ASC")
---
SELECT "associates".* FROM "associates" WHERE "associates"."financial" IS NULL ORDER BY surname ASC

  def allassociates
    @associates = Associate.allassociates.order("surname ASC")
---
SELECT "associates".* FROM "associates" ORDER BY surname ASC

  def update
    respond_to do |format|
      if @associate.update(associate_params)
---
UPDATE "associates" SET "updated_at" = ?, "notes" = ? WHERE "associates"."id" = ?  [["updated_at", "2024-02-24 08:42:04.967723"], ["notes", ""], ["id", 124]]

  def download_csv
    associates_with_financialto = Associate.where.not(financialto: nil)
---
SELECT "associates".* FROM "associates" WHERE "associates"."financialto" IS NOT NULL

  def set_individual
    @associate = Associate.find(params[:id])
---
SELECT "associates".* FROM "associates" WHERE "associates"."id" = ? LIMIT ?  [["id", 124], ["LIMIT", 1]]