app/controllers/individuals_controller.rb

  def create
    @individual = Individual.new(individual_params)

    respond_to do |format|
      if @individual.save
---
INSERT INTO "individuals" ("first", "last", "address1", "address2", "phone", "mobile", "email", "financial_to", "status_id", "created_at", "updated_at", "title_id", "suburb", "postcode", "ivillage_id", "region_id", "notes") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @individual.update(individual_params)
---
UPDATE "individuals" SET "first" = ?, "mobile" = ?, "updated_at" = ? WHERE "individuals"."id" = ?  [["first", "Ron"], ["mobile", "0456 463 231"], ["updated_at", "2024-02-25 00:39:02.743367"], ["id", 385]]

  def download_csv
    individual_financial = Individual.where(status_id: 1)
    filename = "current_individual_members"
    the_day = Date.today.strftime("%d")
    the_month = Date.today.strftime("%m")
    the_year = Date.today.strftime("%Y")
    filename = (filename + "_#{the_day}_#{the_month}_#{the_year}.csv" )

    respond_to do |format|
      format.csv do
        csv_data = CSV.generate(headers: true) do |csv|
          csv << %w[First Name Surname Phone Mobile Email Village]

          individual_financial.each do |individual|
            csv << [individual.first, individual.last, individual.phone, individual.mobile, individual.email, individual.ivillage&.name]
---
SELECT "individuals".* FROM "individuals" WHERE "individuals"."status_id" = ?  [["status_id", 1]]
SELECT "ivillages".* FROM "ivillages" WHERE "ivillages"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

    def set_individual
      @individual = Individual.find(params[:id])
---
SELECT "individuals".* FROM "individuals" WHERE "individuals"."id" = ? LIMIT ?  [["id", 579], ["LIMIT", 1]]