app/controllers/pay_types_controller.rb

SELECT "pay_types".* FROM "pay_types"
---
  def index
    @pay_types = PayType.all

INSERT INTO "pay_types" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2024-02-18 06:41:45.338551"], ["updated_at", "2024-02-18 06:41:45.338551"]]
---
  def create
    @pay_type = PayType.new(pay_type_params)

    respond_to do |format|
      if @pay_type.save

UPDATE "pay_types" SET "name" = ?, "updated_at" = ? WHERE "pay_types"."id" = ?  [["name", "test3"], ["updated_at", "2024-02-18 06:41:55.451740"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @pay_type.update(pay_type_params)

DELETE FROM "pay_types" WHERE "pay_types"."id" = ?  [["id", 5]]
---
  def destroy
    @pay_type.destroy

SELECT "pay_types".* FROM "pay_types" WHERE "pay_types"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_pay_type
      @pay_type = PayType.find(params[:id])