app/controllers/residents_controller.rb

def iscancelled
    @residents = Resident.iscancelled.order("surname ASC").search(params[:search])
---
SELECT "residents".* FROM "residents" WHERE (dateceased is not null) ORDER BY surname ASC