app/controllers/villages_controller.rb

SELECT "villages".* FROM "villages" WHERE (lower(name) LIKE '%Great%' OR lower(email) LIKE '%Great%') ORDER BY name ASC
---
  def index
    @villages = Village.search(params[:search]).order("name ASC")

SELECT "villages".* FROM "villages"
---
  def index
    @villages = Village.search(params[:search])

UPDATE "villages" SET "email" = ?, "updated_at" = ? WHERE "villages"."id" = ?  [["email", "test.test@gmail.com"], ["updated_at", "2024-02-18 09:30:40.401676"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @village.update(village_params)

SELECT "villages".* FROM "villages" WHERE "villages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def download_residents_csv
    @village = Village.find(params[:village_id])

SELECT "villages".* FROM "villages" WHERE "villages"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_village
      @village = Village.find(params[:id])