app/views/associates/show.html.erb

SELECT "associate_payments".* FROM "associate_payments" WHERE "associate_payments"."associate_id" = ?  [["associate_id", 117]]
---
          <tbody>
          <% @associate.associate_payments.each do |payment| %>